// src/seed/categoriesSeed.js
require("dotenv").config();
const mongoose = require("mongoose");
const Category = require("../models/Category");

mongoose.connect(process.env.MONGODB_URI, {
  useNewUrlParser: true,
  useUnifiedTopology: true,
});

async function seedCategories() {
  const categories = [
    {
      name: "Товари для бізнесу",
      subcategories: [{ name: "Універсальні мийки" }],
    },
    {
      name: "Смартфони, ТВ і електроніка",
      subcategories: [
        { name: "Універсальні мобільні батареї" },
        { name: "Тримачі" },
        { name: "Зарядні пристрої" },
        { name: "Штативи" },
        { name: "Смарт-годинники" },
        { name: "Акумулятори для фото- та відеокамер" },
        { name: "Аксесуари до проекторів" },
        { name: "Док-станції" },
        { name: "Студійне світло" },
        { name: "Портативні колонки" },
        { name: "Аксесуари до навушників" },
        { name: "Музичні центри та магнітоли" },
        { name: "Зарядні пристрої для акумуляторних батарей" },
        { name: "Фітнес-браслети" },
      ],
    },
    {
      name: "Комп'ютери та ноутбуки",
      subcategories: [
        { name: "Підставки та столики для ноутбуків" },
        { name: "Клавіатури" },
        { name: "Комплект: клавіатура та миша" },
        { name: "Ігрові клавіатури" },
        { name: "Ігрові миші" },
        { name: "Комп'ютерні миші" },
        { name: "Ігрові поверхні" },
        { name: "Очисні засоби" },
        { name: "Сумки, рюкзаки та чохли для ноутбуків" },
        { name: "Мережеві фільтри, адаптери та подовжувачі" },
        { name: "Аксесуари для клавіатур і мишок" },
        { name: "Блоки живлення для ноутбуків" },
        { name: "Аксесуари для корпусів ПК і ноутбуків" },
      ],
    },
    {
      name: "Сантехніка та ремонт",
      subcategories: [
        { name: "Настільні лампи" },
        { name: "Нічники" },
        { name: "Вуличне освітлення" },
        { name: "Світлодіодні лампи (LED)" },
        { name: "Технічні світильники" },
      ],
    },
    {
      name: "Інструменти та автотовари",
      subcategories: [
        { name: "Ароматизатори у авто" },
        { name: "Пускозарядні пристрої" },
        { name: "Автомобільні інвертори" },
        { name: "Стабілізатори напруги" },
        { name: "Підігрів та приготування їжі і напоїв в авто" },
        { name: "Автомобільні пилососи" },
        { name: "Викрутки" },
      ],
    },
    {
      name: "Товари для дітей",
      subcategories: [{ name: "Іграшки-нічники" }],
    },
    {
      name: "Спорт і захоплення",
      subcategories: [
        { name: "Ліхтарі й аксесуари" },
        { name: "Сонячні зарядні пристрої" },
        { name: "Туристичне гідрообладнання" },
        { name: "Велоаксесуари" },
        { name: "Мультиінструмент" },
        { name: "Туристичні пальники" },
      ],
    },
    {
      name: "Побутова техніка, інтер'єр",
      subcategories: [
        { name: "Вентилятори" },
        { name: "Зволожувачі повітря" },
        { name: "Генератори білого шуму" },
        { name: "Електричні печі" },
        { name: "Тепловентилятори" },
        { name: "Електрочайники" },
        { name: "Електропростирадла" },
        { name: "Праски та прасувальні системи" },
        { name: "Роботи-пилососи" },
        { name: "Мультиварки" },
        { name: "Косметологічні прилади" },
        { name: "Грилі та електрошашличниці" },
        { name: "Настільні плити" },
        { name: "Бутербродниці та вафельниці" },
        { name: "Тостери" },
      ],
    },
    {
      name: "Краса та здоров'я",
      subcategories: [
        { name: "Манікюрний набір" },
        { name: "Бактерицидні опромінювачі" },
        { name: "Крем для обличчя" },
      ],
    },
    {
      name: "Товари для дому",
      subcategories: [
        { name: "Засоби від комах" },
        { name: "Готові сонячні електростанціі" },
        { name: "Термоси та термокухлі" },
        { name: "Розумні замки" },
        { name: "Кондитерський інвентар" },
      ],
    },
    {
      name: "Одяг, взуття та аксесуари",
      subcategories: [{ name: "Чоловічі черевики" }, { name: "Браслети" }],
    },
    {
      name: "Амуніція",
      subcategories: [
        { name: "Тактичні ручки" },
        { name: "Тактичний інструмент" },
      ],
    },
  ];

  await Category.deleteMany({});

  for (const categoryData of categories) {
    const category = new Category(categoryData);
    await category.save();
  }

  console.log("Categories seeded");
  mongoose.connection.close();
}

seedCategories();
