const categoryMap = {
  // Зіставлення ID з фіду до _id вашої підкатегорії
  115155541: "672396b4cdd9c5c5b2a128f9", //Універсальні мийки
  //=============================
  //смартфони тв та електроніка
  //=============================
  115155494: "672396b5cdd9c5c5b2a128fc", //повербаки
  115029698: "672a300a1f4aa7b4f3e6b8bc", //Портативні зарядні станції
  115155521: "672797b77f9ae311cd30af31", //Чохли для телефонів
  115155492: "672396b5cdd9c5c5b2a128fd", //тримач
  115155527: "672396b5cdd9c5c5b2a128fe", //зарядні пристрої
  124174522: "672396b5cdd9c5c5b2a12900", //смарт. год.
  128262937: "672396b5cdd9c5c5b2a12909", //фітнес-брас.
  115155566: "672396b5cdd9c5c5b2a128ff", // Штативи
  115155554: "672396b5cdd9c5c5b2a12901", //акумулятори 18650
  119887058: "672396b5cdd9c5c5b2a12904", //СТУД світло триподи
  120912547: "672396b5cdd9c5c5b2a12902", //аксесуари до проєкторів
  115155514: "672396b5cdd9c5c5b2a12903", //док станції
  119095100: "672396b5cdd9c5c5b2a12905", //портативні колонки
  124174522: "672396b5cdd9c5c5b2a12906", //аксесуари до навушників
  120131519: "672396b5cdd9c5c5b2a12907", //музичні центри та магітоли
  115155527: "672396b5cdd9c5c5b2a12908", //зарядні пристрої для акумуляторних бат.
  //============================
  //компютери та ноутбуки
  //============================
  115155495: "672396b5cdd9c5c5b2a1290c", //підставки та столики для ноутбуків
  127132666: "672396b5cdd9c5c5b2a12917", //блоки живлення для ноутбуків
  115155550: "672396b5cdd9c5c5b2a1290d", //клавіатури
  125215159: "672396b5cdd9c5c5b2a1290d", //клавіатури ===================================!!!!!Під питанням
  115595083: "672396b5cdd9c5c5b2a1290e", //комплект бездротовий клава і миша ============!!!!!
  115651738: "672396b5cdd9c5c5b2a1290f", //ішрові клавіатури ============================!!!!!
  115595082: "672396b5cdd9c5c5b2a12910", //ігрові миші===================================!!!!!
  115155547: "672396b5cdd9c5c5b2a12912", //ігрові поверхні
  127679374: "672396b5cdd9c5c5b2a12913", //очисні засоби
  129266378: "672396b5cdd9c5c5b2a12914", //сумки рюксаки та чохли для ноутів
  //-мереживі фільтри,адаптери та подовжувачі
  128890097: "672396b5cdd9c5c5b2a12916", // аксесуари для клав миш
  //-аксесуари для корпусів ПК і ноутів
  //=============================
  //Сантехніка та ремонт
  //=============================
  115155493: "672396b5cdd9c5c5b2a1291b", //настільні лампи
  126688587: "672e2005a9547066b62b0b6f", //світильники
  119055096: "672396b5cdd9c5c5b2a1291c", //нічники
  119607632: "672396b5cdd9c5c5b2a1291c", //нічники
  119209728: "672396b5cdd9c5c5b2a1291d", //вуличне освітлення
  115155520: "672396b5cdd9c5c5b2a1291d", //вуличне освітленя
  115155519: "672396b5cdd9c5c5b2a1291e", //світлодіодні лампи LED
  //-техічні світильники
  //=============================
  //інструменти та автотовари
  //=============================
  115155562: "672396b5cdd9c5c5b2a12922", //ароматизатори для авто
  115155564: "672396b5cdd9c5c5b2a12923", //пуско-зарядні примтрої
  120215891: "672396b5cdd9c5c5b2a12924", //автомобільні інвертори
  119727589: "672396b5cdd9c5c5b2a12925", //стабілізатори напруги
  118725807: "672396b5cdd9c5c5b2a12926", // приготування їжі у авто
  115155553: "672396b5cdd9c5c5b2a12927", //атомобільні пилососи
  115632276: "672396b5cdd9c5c5b2a12928", //викрутки
  115155546: "672798707f9ae311cd30af32", //Клеєві пістолети та аксесуари
  115155569: "672799667f9ae311cd30af33", //Окуляри для водія
  //=============================
  //Товари для дітей
  //=============================
  115155515: "672396b5cdd9c5c5b2a1292b", //іграшки-нічники
  132085274: "6727811a258f8d269c7f03fb", //Інтерактивні іграшки
  115155534: "6727944d7f9ae311cd30af2d", //Ігрові набори
  115155561: "672796277f9ae311cd30af2f", //Мікрофони
  //=============================
  //Спорт і захоплення
  //=============================
  115155540: "672396b5cdd9c5c5b2a1292e", //ліхтарі та аксесуари
  115155560: "672396b5cdd9c5c5b2a1292f", //соячні зарядні пристрої
  115957507: "672396b5cdd9c5c5b2a12930", //туристичне гідрообладнання
  115155548: "672396b5cdd9c5c5b2a12931", //велоаксесуари
  115155539: "672396b5cdd9c5c5b2a12932", //Мультиінструмент
  119641820: "672396b5cdd9c5c5b2a12933", //туристичні пальники
  //=============================
  //Побутова техніка та інтерєр
  //=============================
  118925718: "672396b5cdd9c5c5b2a12936", //вентилятори
  115155498: "672396b5cdd9c5c5b2a12937", //Зволожувачі повітря
  115155465: "672396b5cdd9c5c5b2a12938", //Генератори білого шуму
  120982578: "672396b5cdd9c5c5b2a12939", //Електричні печі
  120169412: "672396b5cdd9c5c5b2a1293a", //Тепловентилятори
  118725807: "672396b5cdd9c5c5b2a1293b", //Електрочайники
  115155568: "672396b5cdd9c5c5b2a1293c", //Електропростирадла
  121207087: "672396b5cdd9c5c5b2a1293d", //Праски та прасувальні системи
  122766861: "672396b5cdd9c5c5b2a1293e", //Роботи-пилососи
  120632995: "672396b5cdd9c5c5b2a1293f", //Мультиварки
  115155456: "672396b5cdd9c5c5b2a12940", //Косметологічні прилади
  115155462: "672396b5cdd9c5c5b2a12941", //Грилі та електрошашличниці
  119467404: "672396b5cdd9c5c5b2a12942", //Настільні плити
  127893468: "672396b5cdd9c5c5b2a12943", //Бутербродниці та вафельниці
  118725806: "672396b5cdd9c5c5b2a12944", //Тостери
  //=============================
  //Краса та здоровя
  //=============================
  115155516: "672396b5cdd9c5c5b2a12947", //Манікюрний набір
  115155532: "672a2f8c1f4aa7b4f3e6b8bb", //Туш для вій
  115155557: "67279ed97f9ae311cd30af35", //Жіноча парфумерія
  115155558: "67279fd57f9ae311cd30af36", //Чоловіча парфумерія
  115155567: "672797247f9ae311cd30af30", //Зубна паста
  120169413: "672396b5cdd9c5c5b2a12948", //Бактерицидні опромінювачі
  115155565: "672396b5cdd9c5c5b2a12948", //Бактерицидні опромінювачі
  115155496: "672396b5cdd9c5c5b2a12949", //Крем для обличчя
  115155530: "67279de07f9ae311cd30af34", //Косметичні прилади
  119607630: "672a32911f4aa7b4f3e6b8bd", //Прилади для укладання волосся
  128890099: "672e0159a9547066b62b0b6e", //спортивне харчування
  //=============================
  //Товари для дому
  //=============================
  115155544: "672396b5cdd9c5c5b2a1294c", //Засоби від комах
  115155528: "67264a99d4daf423fd2b9ac2", //Автономні системи резервного живлення
  115155535: "6727951c7f9ae311cd30af2e", //Тримери для тканини
  //-Готові сонячні електростанції
  115155560: "67264a99d4daf423fd2b9ac2", //Автономні системи резервного живлення
  121618247: "672396b5cdd9c5c5b2a1294e", //Термоси та термокухлі
  115155549: "672396b5cdd9c5c5b2a1294f", //Розумні замки
  115155512: "672396b5cdd9c5c5b2a12950", //Кухонне приладдя
  115155500: "672792b37f9ae311cd30af2b", //Зонти
  115155536: "6727939e7f9ae311cd30af2c", //Харчові контейнери
  115155513: "6727a93c7f9ae311cd30af37", //Шланги
  //=============================
  //Одяг, взуття та аксесуари
  //=============================
  136282899: "672396b5cdd9c5c5b2a12953", //Чоловічі черевики
  128120254: "672396b5cdd9c5c5b2a12954", //Браслети
  //=============================
  //Амуніція
  //=============================
  // : "672396b5cdd9c5c5b2a12957", //Тактичні ручки
  // : "672396b5cdd9c5c5b2a12958", //Тактичний інструмент
};
module.exports = categoryMap;
